export function getCoord (cityName){
    if (cityName.length == 2) {
        cityName = cityName + '市'
    }
    let coord = []
    coord=geoCoordMap[cityName]
    return coord
}

const geoCoordMap = {
    厦门市: [118.11022, 24.490474,20],
    福州市: [119.206239, 26.275302,20],
    泉州市: [118.589421, 24.908853,20],
    漳州市: [117.561801, 24.510897,20],
    龙岩市: [116.82978, 25.391603,20],
    莆田市: [119.007558, 25.591011,20],
    三明市: [117.435001, 26.465444,20],
    南平市: [118.178459, 27.535627,20],
    宁德市: [119.527082, 27.15924,20],
};